'''

Создайте пустой объект frozenset и сохраните его в переменную my_frozen, затем выведите на экран эту переменную

'''

my_frozen = frozenset()
print(my_frozen)
