'''

Перед вами персонажи одного знаменитого сериала. Один из главных героев любит в конце своего предложения вставлять фразу «Сказала она!»

Давайте и мы напишем такую программу. Она принимает на вход предложение и и затем печатает его с фразой «Сказала она!» в конце определенным образом 
(см. примеры). Пользуйтесь аргументом end  и следите за символами, которые печатаются.

 
А вы знаете, что это сериал? Если нет, то попробуйте в комментариях угадать его название.

А для тех кто знает этот шедевр, жду в комментариях ответа на вопросы «Кто твой любимый персонаж?» или «Какой любимый момент?»

Sample Input 1:

hello

Sample Output 1:

hello - Сказала она!

Sample Input 2:

easy peasy

Sample Output 2:

easy peasy - Сказала она!

'''

print(input(), end=' - Сказала она!')
