'''

Напишите программу, которая выводит на экран сообщение Привет, Мир!

Sample Input:

Sample Output:

Привет, Мир!

'''

print('Привет, Мир!')
