'''

Выведите в консоль следующую строку: \\\'. Попробуйте решить задачу двумя способами.

Sample Input:

Sample Output:

\\\'

'''

print(r"\\\'")
