lst = [{'номер': 1, 'облачность': 'ясно', 'температура': 26},
       {'номер': 2, 'облачность': 'облачно', 'температура': 18},
       {'номер': 3, 'облачность': 'ясно', 'температура': 15},
       {'номер': 4, 'облачность': 'ясно', 'температура': 22},
       {'номер': 5, 'облачность': 'ясно', 'температура': 25},
       {'номер': 6, 'облачность': 'облачно', 'температура': 28},
       {'номер': 7, 'облачность': 'ясно', 'температура': 32},
       {'номер': 8, 'облачность': 'облачно', 'температура': 11},
       {'номер': 9, 'облачность': 'ясно', 'температура': 18}
       ]       

# продолжите решение здесь
lst1 = []
lst2 = []
for i in lst:
    match i:
        case {'облачность': 'ясно'} if i['температура'] >= 25:
            lst1.append(i)
        case _:
            lst2.append(i)

print(lst1)
print(lst2)
