'''

Подвиг 4. Имеется закодированная строка с помощью азбуки Морзе. Коды разделены между собой пробелом. 
Необходимо ее раскодировать, используя азбуку Морзе из предыдущего занятия. Полученное сообщение (строку) вывести на экран.

Sample Input:

.-- ... . -...- .-- . .-. -. ---

Sample Output:

все верно

'''

d = {'а': '.-', 'б': '-...', 'в': '.--', 'г': '--.', 'д': '-..', 'е': '.', 'ж': '...-',
         'з': '--..', 'и': '..', 'й': '.---', 'к': '-.-', 'л': '.-..', 'м': '--', 'н': '-.', 'о': '---',
         'п': '.--.', 'р': '.-.', 'с': '...', 'т': '-', 'у': '..-', 'ф': '..-.', 'х': '....', 'ц': '-.-.',
         'ч': '---.', 'ш': '----', 'щ': '--.-', 'ъ': '--.--', 'ы': '-.--', 'ь': '-..-', 'э': '..-..',
         'ю': '..--', 'я': '.-.-', ' ': '-...-'}

d_new = {value: key.lower() for key, value in d.items()}

s = input().split()
result = ''                     
for value in s:        
    result += d_new[value]
print(result)
