'''

Задание:

    Создайте класс Car.
    Создайте атрибут color внутри класса, со значением "blue"
    Выведите на экран значение атрибута color с помощью print()

Sample Input:

Sample Output:

blue

'''

class Car:
    color = 'blue'
print(Car.color)
