'''

Вася наконец-то смог заниматься по 2 часа без перерыва и решил пощеголять своими знаниями перед Машенькой. 
Он попросил у неё учебник по математике, чтобы решить задачку, используя классы.
Задание:

    Создайте класс Number и два атрибута: num1 и num2, со значениями 5 и 10 соответственно.
    Выведите на экран сумму значений этих атрибутов, используя обращения к атрибутам через точку.

Sample Input:

Sample Output:

15

'''

# put your python code here
class Number:
    num1 = 5
    num2 = 10
    
print(Number.num1 + Number.num2)
