'''

Создайте пустое множество и сохраните его в переменную my_set, затем выведите на экран эту переменную

'''

my_set = set()
print(my_set)
