'''

Банк обещает внесенную вами сумму увеличить за год в 1.5 раза. Ваша программа должна посчитать сколько вы получите через год, если внесете x рублей
Входные данные

Вещественное число x - количество рублей, которые вносите в банк
Выходные данные

Итоговая сумма через год

Sample Input 1:

100

Sample Output 1:

150.0

Sample Input 2:

6.3

Sample Output 2:

9.45

Sample Input 3:

11

Sample Output 3:

16.5

Sample Input 4:

0.5

Sample Output 4:

0.75

'''

a = float(input())
a *= 1.5
print(a)
