'''

Найдите результат выражения ∣a∣+∣b∣∣a∣+∣b∣

Значения переменных а и b поступают на вход в отдельных строках и могут быть только целого типа

Sample Input 1:

-5
9

Sample Output 1:

14

Sample Input 2:

-1
-4

Sample Output 2:

5

'''

print(abs(int(input()))+abs(int(input())))
