'''

Я думаю каждый знаком с квадратом - идеально симметричная и ровная фигура. Давайте напишем программу, которая вычисляет площадь квадрата по введенной длине.

Формула вычисления площади квадрата следующая:

S=a2

Входные данные

На вход программе поступает вещественное число a

Выходные данные

Программа выводит площадь квадрата

Sample Input 1:

7

Sample Output 1:

49.0

Sample Input 2:

1.5

Sample Output 2:

2.25

Sample Input 3:

0.5

Sample Output 3:

0.25

'''

a = float(input())
print(a**2)
