'''

Напишите программу, которая принимает на вход два целых числа в отдельных строках и выводит на экран их сумму.

Sample Input 1:

7
5

Sample Output 1:

12

Sample Input 2:

100
200

Sample Output 2:

300

Sample Input 3:

3119
3942

Sample Output 3:

7061

'''

a = int(input())
b = int(input())
print(a+b)
