'''

Напишите программу, которая принимает на вход возраст человека (количество полных лет) и выводит сколько лет ему исполнится в следующем году
🚀Если не справляетесь, здесь подсказка🚀

Sample Input 1:

7

Sample Output 1:

8

Sample Input 2:

54

Sample Output 2:

55

'''

print(int(input())+1)
