'''

Напишите программу, которая распечатает все натуральные числа от 1000 до 2000 включительно.

Каждое число следует выводить на отдельной строчке как в примере ниже

1000
1001
1002
...
1998
1999
2000

'''

a = 1000
while a != 2001:
    print(a)
    a+=1
