'''

Премия Оскар

Представьте, что мы с вами сами можем решать кому и сколько статуэток Оскара уйдет (Лео бы тогда давно купался в этих статуэтках)

Ваша задача написать программу, которая находит информацию, кто из актеров получил наибольшее и наименьшее количество статуэток
Входные данные

Программа принимает на вход в первой строке натуральное число n - количество вручаемых сегодня наград. 
И затем в n следующих строках вводятся имена актеров - победителей.
Выходные данные

Нужно вывести в  отдельных строках имена актеров набравших наибольшее и наименьшее количество статуэток и через запятую их количество. 
Гарантируется, что всегда будет только один человек, набравший наибольшее и наименьшее количество статуэток.

Sample Input:

6
Леонардо Ди Каприо
Джонни Депп
Леонардо Ди Каприо
Леонардо Ди Каприо
Джонни Депп
Мэтт Деймон

Sample Output:

Леонардо Ди Каприо, 3
Мэтт Деймон, 1

'''

lst = {}
for i in range(int(input())):
    i = input()
    if i not in lst:
        lst[i] = 1
    else:
        lst[i] += 1

lst = sorted(lst.items(), key=lambda x: x[1], reverse=True)
print(f'{lst[0][0]}, {lst[0][1]}')
print(f'{lst[-1][0]}, {lst[-1][1]}'
