asdfgh = [['Противоударный захват кулака лицом', ' '], ['а у вас пиксели убежали', '!'],
          ['сырная неизбежность бытия', ' '], ['аля улю', '^'], ['тра ля ля', '%']]

# вводные данные
dct = {'ё': 'yo', 'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ж': 'zh',
     'з': 'z', 'и': 'i', 'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p',
     'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'ch', 'ш': 'sh',
     'щ': 'shch', 'ъ': '', 'ы': 'y', 'ь': '', 'э': 'e', 'ю': 'yu', 'я': 'ya'}

# продолжите решение здесь
def func(text, sep=' '):
    text = text.lower()
    result = ''
    for char in text:
        if char in dct:
            result += dct[char]
        elif char == ' ':
            result += sep
        else:
            result += char
    return result
