'''

Напишите функцию exponentiation, которая принимает на вход целое число и выводит на экран через пробел квадрат и куб этого числа. 

Вам необходимо написать только определение функции exponentiation

Sample Input 1:

3

Sample Output 1:

9 27

Sample Input 2:

2

Sample Output 2:

4 8

Sample Input 3:

10

Sample Output 3:

100 1000

'''

def exponentiation(n):
    print(n**2,n**3)
