def input_my_desires(*args: str) -> None:
     """
     Эта функция принимает и исполняет мои желания.

     :param args: кортеж с желаниями
     :return: None
     """
     print("Ваши желания приняты! А теперь приложите усилия для их исполнения!")


input_my_desires("Написать достойный курс для python-начинашек",
                 "Хочу поменьше спать", "Хочу познать суть всего сущего",
                 "Хочу чтобы люди обрели свободу, счастье и радость"
                 "Хочу чтобы кошки были сыты и обосновано делали кусь")
