'''

Напишите программу, которая выводит текст ниже:

Привет;мне;нравится;программирование

но писать код что-то не очень.Может поможешь?

При разработке своего решения учтите, что может прийти злой менеджер и попросить вас заменить например ;  на любой другой символ. 
Было бы хорошо, чтобы вы могли сделать замену в одном месте, а не трех.

Sample Input:

Sample Output:

Привет;мне;нравится;программирование

но писать код что-то не очень.Может поможешь?

'''

print('Привет','мне','нравится','программирование',sep = ';')
print()
print('но писать код что-то не очень.Может поможешь?')
