'''

Напишите программу, которая выведет текст ниже. Обратите внимание, что строки со словами разделены пустыми строками.

Я

будущий

Python-разработчик!

Sample Input:

Sample Output:

Я

будущий

Python-разработчик!

'''

print('Я')
print()
print('будущий')
print()
print('Python-разработчик!')
