'''

Выведите текст:

Иван сказал: "Ты зачем выделил все свои слова одинарными кавычками?".
Антон ответил: "'Если' 'бы' 'я' 'знал'".

Sample Input:

Sample Output:

Иван сказал: "Ты зачем выделил все свои слова одинарными кавычками?".
Антон ответил: "'Если' 'бы' 'я' 'знал'".

'''

print('Иван сказал: "Ты зачем выделил все свои слова одинарными кавычками?".')
print('Антон ответил: "\'Если\' \'бы\' \'я\' \'знал\'".')
