'''

Выведите слова  красный, оранжевый, желтый, зеленый. Разделите их с помощью \t.

Программа должна вывести:

красный    оранжевый    желтый    зеленый

'''

print('красный','оранжевый','желтый','зеленый',sep = '\t')
