/*

Напишите программу, которая просит у пользователя число, а затем выводит умножение этого числа на числа от 1 до 10.

Sample Input 1:

7

Sample Output 1:

7 * 1 = 7
7 * 2 = 14
7 * 3 = 21
7 * 4 = 28
7 * 5 = 35
7 * 6 = 42
7 * 7 = 49
7 * 8 = 56
7 * 9 = 63
7 * 10 = 70

Sample Input 2:

9

Sample Output 2:

9 * 1 = 9
9 * 2 = 18
9 * 3 = 27
9 * 4 = 36
9 * 5 = 45
9 * 6 = 54
9 * 7 = 63
9 * 8 = 72
9 * 9 = 81
9 * 10 = 90

Sample Input 3:

4

Sample Output 3:

4 * 1 = 4
4 * 2 = 8
4 * 3 = 12
4 * 4 = 16
4 * 5 = 20
4 * 6 = 24
4 * 7 = 28
4 * 8 = 32
4 * 9 = 36
4 * 10 = 40

*/

let n = Number(prompt());
let count = 1

while (count <= 10) {
    console.log(n,'*',count,'=',n*count);
    count++;
}
