'''

Предлагаю закрепить темы и немного познакомиться с участниками курса.  
Создайте свою анкету, по примеру, который я предоставлю ниже. 
По возможности, не копируйте, а напечатайте руками, чтобы закрепилось лучше. Помните, чем больше вы пишите руками на начальном этапе, 
тем быстрее это дойдёт до автоматизма, и отложится в памяти.

class Person:
    music = 'любимая песня, или группа, или стиль музыки'
    ufo = 'верите ли вы в нло?'
    film = 'ваш любимый фильм за последнее время или за всё время'
    what = 'что хотите делать с помощью программирования?'
    # можете добавить что-то своё, если хотите

# ниже ваш код:

buddha = Person()
buddha.music = 'Paramore'
buddha.ufo = 'я сам как нло'
buddha.film = 'Амадей, 1984, про Моцарта'
buddha.what = 'Хочу обучать программированию'
buddha.cat = 'Кот - "Чуктус", всё время будит по утрам, и царапает диван'

'''

class Person:
    music = 'любимая песня, или группа, или стиль музыки'
    ufo = 'верите ли вы в нло?'
    film = 'ваш любимый фильм за последнее время или за всё время'
    what = 'что хотите делать с помощью программирования?'
    # можете добавить что-то своё, если хотите

# ниже ваш код:
me = Person()
me.music = 'What is love? Oh baby, don\'t hurt me, don\'t hurt me no more…'
me.ufo = 'Кто может поверить, что я не из космоса?'
me.film = 'Бегущий по лезвию 2049'
me.what = 'Творить'
me.shine = 'Always'
