'''

Задание:

    Создайте класс Person
    Создайте атрибут name внутри класса, и присвойте ему значение "Vasya"
    Создайте экземпляр класса и назовите его id_1. Не забывайте про скобки у класса.
    Выведите на экран значение атрибута name, экземпляра id_1, используя print()

Sample Input:

Sample Output:

Vasya

'''

class Person:
    name = 'Vasya'
id_1 = Person()
print(id_1.name)
