'''

Задание:

    Создайте пустой класс Сoordinate (используйте pass).
    Создайте экземпляр coord класса Сoordinate.
    Создайте атрибут "x" в экземпляре coord, со значением 100.
    Измените атрибут "x"  в экземпляре coord на число 5.
    Выведите на экран значение атрибута "x" экземпляра coord, с помощью print.

Sample Input:

Sample Output:

5

'''

class Coordinate:
    pass
coord = Coordinate()
coord.x = 100
coord.x = 5
print(coord.x)
