employees = [
    ['Алексей К.', 'Владимир О.', 'Ульяна П.', 'Кирилл Р.', 'Анна С.',
     'Марат М.', 'Ульяна П.', 'Олег В.', 'Ульяна П.'],
    ['Никита Д.', 'Владимир О.', 'Кирилл Р.', 'Анна С.', 'Марат М.',
     'Ульяна П.', 'Олег В.', 'Никита Д.', 'Владимир О.'],
    ['Алексей К.', 'Владимир О.', 'Кирилл Р.', 'Анна С.', 'Марат М.', 'Ульяна П.',
     'Олег В.', 'Никита Д.', 'Елена Р.', 'Олег Р.', 'Кирилл Р.', 'Кирилл Р.'],
    ['Олег В.', 'Никита Д.', 'Елена Р.', 'Олег Р.', 'Владимир О.', 'Кирилл Р.', 'Анна С.'],
    ['Алексей К.', 'Владимир О.', 'Кирилл Р.', 'Анна С.', 'Марат М.', 'Ульяна П.',
     'Олег В.', 'Никита Д.', 'Елена Р.', 'Олег Р.', 'Владимир О.', 'Кирилл Р.', 'Анна С.'],
    ['Алексей К.', 'Кирилл Р.', 'Анна С.', 'Марат М.', 'Ульяна П.',
     'Олег В.', 'Никита Д.', 'Елена Р.', 'Олег Р.'],
    ['Алексей К.', 'Владимир О.', 'Кирилл Р.', 'Анна С.', 'Марат М.', 'Ульяна П.',
     'Олег В.', 'Никита Д.', 'Анна С.', 'Олег Р.', 'Кирилл Р.']
]        

# продолжите решение здесь
all_employees = frozenset(name for day in employees for name in day)
skippers = {}

for day in employees:
    daily_employees = frozenset(day)
    for name in all_employees - daily_employees:
        skippers[name] = skippers.get(name, 0) + 1

skippers = {k: v for k, v in skippers.items() if v > 1}

print(' | '.join(f"{k}: {v}" for k,v in sorted(skippers.items())))
