'''

Выведите всё валидное время, которое находится в строке.
Что нужно сделать:

Нужно найти последовательности, подходящие по следующим условиям:

    Часы от 0 до 23
    Потом идёт :
    Минуты от 0 до 59
    Если в последовательности количество часов или минут меньше 10, то перед ним стоит 0
    Не является подпоследовательностью

Тестовые данные:
Входные данные:

На вход программе подаётся 1 строка.
Выходные данные:

Ваша задача вывести всё валидное время в тексте.

Sample Input 1:

13:79 24:33 02:60 03:81 23:59 28:64 46:50 14:39 91:19 13:35 02:57 10:10 00:00 59:59 15:51

Sample Output 1:

23:59
14:39
13:35
02:57
10:10
00:00
15:51

Sample Input 2:

05:51 22:57 23:02 07:64 14:73 09:09 09:51 47:61 48:17 52:74 77:29 12:25 06:39 36:26 02:06 09:37 69:11 58:50 20:70 25:44 18:66 41:52 39:41 48:77 65:62 23:32 60:07 73:13 71:79 67:64 15:28 46:74 22:03 42:10 18:56 49:24 78:66 07:48 04:47 49:78 18:42 45:16 01:64 26:39 06:01 72:58 76:75 75:13 44:58 53:50 46:25 00:47 00:18 78:69 36:60 28:08 13:00 42:73 37:54 29:66 14:26 21:66 16:46 49:03 52:33 34:40 75:73 57:35 36:22 24:63 38:77 58:77 76:17 65:73 46:03 47:42 26:35 76:41 32:73 62:76 77:12 56:44 48:27 37:25 73:77 79:79 76:29 44:05 66:47 20:11 38:00 02:22 33:50 53:16 29:17 47:62 21:16 33:02 76:37 11:43

Sample Output 2:

05:51
22:57
23:02
09:09
09:51
12:25
06:39
02:06
09:37
23:32
15:28
22:03
18:56
07:48
04:47
18:42
06:01
00:47
00:18
13:00
14:26
16:46
20:11
02:22
21:16
11:43

'''

import re

result = re.findall(r'[0-1][\d]\:[0-5]\d|[2][0-3]\:[0-5]\d+', input())
for i in result:
    print(i)
