/*

Даны два указателя по тем же правилам, что и в пред. задаче.

Выведите сумму переменных, на которые ссылаются данные указатели.

P.S. Полный исходный код задачи доступен на форуме для решивших задачу.

Sample Input:

7 8

Sample Output:

15

*/

printf("%d",*p_2+*p_1);
