/*

Напишите программу, которая 61 раз выводит слово "Поехали", используя цикл for.

Sample Input:


Sample Output:

Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали
Поехали

*/

for (let i = 1; i <= 61; i++) {
  console.log("Поехали");
}
