'''

Большинство задач в этом курсе будет именно на программирование. От вас требуется написать код согласно условию задачи на языке программирования python, 
вставить его окно ввода и нажать Отправить. Далее ваш код будет тестироваться и проверяться правильно ли он работает, сможет ли он решить поставленную проблему. 
В случае успеха вы получите баллы за задачу.

Сейчас ниже уже представлен код, который выводит несколько сообщений на экране. Ваша задача только нажать кнопку Отправить

'''

print("Ухххх, скоро выучу ваш этот питон!")
print("И в гугл устроюсь сразу")
