/*

Напишите программу, которая выводит на экран следующие строки:

Hello, World!
The world is yours!

Sample Input:


Sample Output:

Hello, World!
The world is yours!

*/

#include <stdio.h>

int main() {
  printf("Hello, World!\n");
  printf("The world is yours!\n");
  return 0;
}
