# 🔹Твоя задача: написать три генератора множеств
# Используя report_stats (показатели из отчёта) и best_stats (эталонный список), заполни три множества с помощью генераторов:

# ✅ Найденные лучшие показатели (пересечение отчёта и эталона).
# ✅ Отсутствующие показатели (есть в эталоне, но не в отчёте).
# ✅ Лишние показатели (есть в отчёте, но не входят в лучшие).
# Выводить их ненужно, использовать переменные из описания к задаче!

# Считываем список показателей из отчёта (через запятую)
report_stats = set(input().split(', '))

# Считываем frozenset лучших показателей (через запятую)
best_stats = frozenset(input().split(', '))

# далее ваш код
found_best = {stat for stat in report_stats if stat in best_stats}
missing_best = {stat for stat in best_stats if stat not in report_stats}
extra_stats = {stat for stat in report_stats if stat not in best_stats}
