'''

Создайте две переменные name и age, которые получают свое значение из пользовательского ввода. 
Добавьте к переменной name подсказку Ваше имя:, а к переменной age подсказку Ваш возраст:. Далее выведите значения переменных через пробел на экран.

Например, результат работы программы для имени Иван и возраста 30 будет таким:

Иван 30

Причем, когда человек вводит значения должны показываться подсказки:

Ваше имя:

и затем:

Ваш возраст:

Пример ввода данных:

Ваше имя:Иван
Ваш возраст:30

Пример вывода: 

Иван 30

'''

name = input('Ваше имя:')
age = input('Ваш возраст:')
print(name,age)
