'''

Напишите программу, которая получает на вход строку и число, и затем выводит их в следующем формате:

Это число: {число}
Это строка: {строка}

Например для числа 17 и строки abc нужно вывести:

Это число: 17
Это строка: abc

Следите за лишними символами! Если степик не принимает ваше решение, то проверьте, что в нем нет лишних пробелов.

Подсказки выводить не нужно, делаем не для человека, а для бездушной машины Степика. Это означает, что так input("Моя подсказка") делать не нужно. Тестирующая система такой ответ не примет.

Sample Input 1:

19
моя строка

Sample Output 1:

Это число: 19
Это строка: моя строка

Sample Input 2:

20
21

Sample Output 2:

Это число: 20
Это строка: 21

Sample Input 3:

100
1000

Sample Output 3:

Это число: 100
Это строка: 1000

'''
