'''

Создайте две переменные a и b, которые получают свое значение из пользовательского ввода. Выведите значения переменных через пробел на экран.

Подсказки использовать в этом задании не нужно. Это означает, что в input() не нужно передавать аргументы.

'''

a = input()
b = input()
print(a,b)
