'''

Напишите программу, которая будет складывать два числа введёные с клавиатуры.

Sample Input:

2
2

Sample Output:

4

'''

a = int(input())
b = int(input())
print(a+b)
