'''

Напишите программу, которая будет складывать два слова введённые с клавиатуры.

Sample Input:

Кван
ториум

Sample Output:

Кванториум

'''

a = input()
b = input()
print(a+b)
