'''

1) Создайте пустой список с возможностью его заполнения с клавиатуры через функцию append.
2) Выведите его в консоль.

Sample Input:

дом

Sample Output:

['дом']

'''

a = []
a.append(input())
print(a)
