'''

1) Создайте пустой список с возможностью его заполнения с клавиатуры через функцию extend.
2) Выведите его в консоль.

Sample Input:

дом

Sample Output:

['д', 'о', 'м']

'''

a = []
a.extend(input())
print(a)
