'''

    Создайте класс GuruPython.
    Создайте описание класса, используя докстринги. Введите такую информацию:
    Все, кто проходит этот курс становятся Гуру в Python!
    Выведите на экран описание класса GuruPython используя атрибут __doc__.

Sample Input:

Sample Output:

Все, кто проходит этот курс становятся Гуру в Python!

'''

class GuruPython:
    '''Все, кто проходит этот курс становятся Гуру в Python!'''

print(GuruPython.__doc__)
