'''

Подвиг 6. Напишите программу отображения всех символов с нечетными индексами из введенной строки.

Sample Input:

Balakirev

Sample Output:

aaie

'''

print(input()[1::2])
