'''

Подвиг 4. Напишите программу отображения первых четырех символов из введенной строки. 
Будем полагать, что строка гарантированно длиной не менее четырех символов.

Sample Input:

panda

Sample Output:

pand

'''

print(input()[:4])
