cities = [
    "Москва", "Петербург", "Томск", "Казань", "Екатеринбург", "Новосибирск", "Сочи", "Калуга", "Воронеж", "Уфа",
    "Самара", "Краснодар", "Челябинск", "Пермь", "Нижний Новгород", "Красноярск", "Саратов", "Тверь", "Рим", "Милан",
    "Барселона", "Мадрид", "Лондон", "Берлин", "Амстердам", "Париж", "Вена", "Лиссабон", "Прага", "Брюссель",
    "Афины", "Будапешт", "Мюнхен", "Римини", "Стамбул", "Тегеран", "Каир", "Токио", "Пекин", "Шанхай", "Сеул",
    "Сидней", "Мельбурн", "Нью-Йорк", "Чикаго", "Лос-Анджелес", "Калифорния", "Квебек", "Монреаль", "Торонто",
    "Сан-Франциско", "Мехико", "Буэнос-Айрес", "Рио-де-Жанейро", "Сан-Паулу", "Канкун", "Лима", "Кито", "Каракас",
    "Монтевидео", "Тегусигальпа", "Богота", "Сантьяго", "Кито", "Лагос", "Йоханнесбург", "Кейптаун", "Лагос",
    "Гонконг", "Тайбэй", "Манила", "Бангкок", "Дубай", "Куала-Лумпур", "Сингапур", "Бали", "Мумбаи", "Дели",
    "Калкутта", "Гоа", "Коломбо", "Мале", "Лагос", "Тбилиси", "Ереван", "Баку", "Ташкент", "Алма-Ата",
    "Минск", "Кишинёв", "Вильнюс", "Бухарест", "Таллинн", "Рига", "Лондон", "Мадрид", "Рим", "Берлин",
    "Штутгарт", "Зальцбург", "Пиза", "Мюнхен", "София", "Подгорица", "Београд", "Будапешт", "Братислава", "Лиссабон",
    "Париж", "Барселона", "Лиссабон", "Дублин", "Стокгольм", "Осло", "Копенгаген", "Хельсинки", "Лион", "Марсель",
    "Тулуза", "Лилль", "Монпелье", "Ницца", "Бордо", "Руан", "Тур", "Ажен", "Шартр", "Морле", "Гавр", "Лимож", "Клермон-Ферран"
]

start = int(input())
end = int(input())

sublist = cities[start:end]

sublist.sort()

cities[start:end] = sublist

print("Список городов с отсортированным срезом:")
for i, city in enumerate(cities, start=1):
    print(f"{i}. {city}")
