user = {
    "id": 1,
    "имя": "Моисей",
    "фамилия": "Борисов",
    "username": "supermos'ka43",
    "email": "moisbor43@mail.com",
    "пол": "неопределён",
    "адрес": "Москва, ул. Тазобедренная 47",
    "номер_телефона": "+84575938657",
    "дата_рождения": "1936-09-17",
    "работа": {
        "название_организации": "МосГорВодПотКотРотКротГазВотТеРаз ",
        "должность": "дождевик"
    },
}

# продолжить решение здесь
a = input().split()
res = {key: user[key] for key in a if key in user}
print(res)
