'''

В этой задаче вам необходимо научиться генерировать html-код на питоне и сдать на проверку html-файл, 
в котором будет таблица размером 10 на 10, которая должна содержать таблицу умножения для чисел от 1 до 10. 
При открытии вашего файла в браузере это должно выглядеть примерно так:

Ваш файл должен начинаться с тегов <html> и <body> и заканчиваться </body> и </html>.

Для создания таблицы можно пользоваться тегами <table> (создание таблицы), <tr> (создание строки в таблице) и <td> (создание отдельной ячейки). 
Все открытые теги нужно закрыть, причем сделать это нужно в правильном порядке.

Пожалуйста, не используйте никаких украшений и других тегов - мы не сможем проверить такие решения.

'''

from yattag import Doc

doc, tag, text = Doc().tagtext()

with tag('html'):
    with tag('body'):
        with tag('table'):
            for i in range(1,11):
                with tag('tr'):
                    for j in range(1,11):
                        with tag('td'):
                            text(i*j)

result = doc.getvalue()

with open('5.02.html', 'w') as file:
    file.write(result)
