'''

Написать программу, которая выводит сообщение "Я изучаю Python!".

Для этого:

    реализовать программу на локальном компьютере, запустить ее, проверить, чтобы выдавалось необходимое сообщение (в принципе можно писать программу прямо здесь....);
    скопировать и вставить операторы программы в окно кода на данном шаге;
    запустить программу на выполнение, кликнув на кнопку Выполнить, проверить результат;
    если программа работает правильно, отправить ее на проверку (кликнуть на кнопку Отправить).

Ваша программа будет проверена, результат будет показан в браузере. Если в ней будут найдены ошибки, Вы можете их исправить и снова отправить задачу на проверку.

Sample Input:

Sample Output:

Я изучаю Python!

'''

print('Я изучаю Python!')
