/*

В этом задании в нашу функцию передаются два параметра: целочисленная переменная ("а") и некоторая функция ("func"). 
Вам необходимо запустить функцию "func", с переменной "а" в качестве аргумента. Но вот проблема - в функции, похоже, оказалась ошибка. 
Вам нужно возвратить имя (свойство "name") возникающей ошибки.

Sample Input:

9

Sample Output:

EvalError

*/

function testErrorFunc(a, func) {         
    try {
        func(a);
    } catch(ex) {
      x = ex.name;
    }
    return x;
}
