'''

Подвиг 5. На вход программы подается целое десятичное число. Используя битовые операции, 
выполните умножение введенного числа на 4. Результат отобразите на экране.

Sample Input:

40

Sample Output:

160

'''

# put your python code here
a = int(input())
x = a << 2
print(x)
