'''

Вам дана строка s. Определите количество слов в строке, записанных через пробел.

Sample Input:

два слова

Sample Output:

2

'''

print(len(input().split()))
