'''

Подвиг 2. В программе определите три следующие переменные:

a = 7
b = -4
c = 3

Выведите в консоль их значения в столбик (каждое новое значение отображается с новой строчки), используя одну функцию print.

Sample Input:


Sample Output:

7
-4
3

'''

a = 7
b = -4
c = 3
print(a,b,c,sep='\n')
